function registerTrigrams(container) {
  const language = container.get('Language');
  if (language) {
    language.addModel(
      'Cyrillic',
      'rus',
      ' пр и равств напраго ениовево  каанить  в  по обия сво свловна  чеелоо н соостчелие огоет нияеставоый ажд имниевек нельнли оваимеатьприт пи пкажилиобо раых жды додыйвобек бодва й чегося и сии ациеетно мееи иленой тваныхто  илк иенн быию  зами твои но пвано сстоаль всом о вьноих ноги вновакопроий стии опололждолое брая в оснымженразти нося и воторвсе егей телне и рредельтвеоди кообщо и деимаа ичеснимснокак лищесвлеьсянныасттьснноосуе д отпрешена сбщеосноднбытсовытьлжнранниюичеак ым ватчтостучене в стресоль ниномродля нарвенду ожены е и товера озовм инацденринтупеждстр чтя понадосх ий итояеспличбесобротоо бьныь вниие мую  моем  меаро реавакотав  выам жностаая поди кное к  та гогоссудеобя нен и дможескелиавнве ечеущепечдноо дходка  длдляовоательсю ив кненциинойудавов беоронстамициаконсеме овно этазох пни ждем пкогот дствныстьые о опоссретраейстаки бдовму я кналдру дркойтерь парсизнсоцедиолн'
    );
  }
}

export default registerTrigrams;
