import { NlpUtil } from '../../../src/nlp/index.js';

const feats = {
  ΚΡΕΑΣ: 'ΚΡΕ',
  ΠΑΝΓΚΡΕΑΣ: 'ΠΑΝΓΚΡΕ',
  ΗΜΙΦΩΣ: 'ΗΜΙΦΩ',
  ΚΟΜΠΟΛΟΓΙΑ: 'ΚΟΜΠΟΛΟΓ',
  ΠΑΤΕΡΑΣ: 'ΠΑΤΕΡ',
  ΓΙΑΓΙΑΔΩΝ: 'ΓΙΑΓΙ',
  ΟΜΑΔΕΣ: 'ΟΜΑΔ',
  ΚΑΦΕΔΩΝ: 'ΚΑΦ',
  ΓΗΠΕΔΩΝ: 'ΓΗΠΕΔ',
  ΠΑΠΠΟΥΔΩΝ: 'παππουδ', // ΠΑΠΠΟΥΔΩΝ: 'ΠΑΠΠ'
  ΑΡΚΟΥΔΕΣ: 'ΑΡΚΟΥΔ',
  ΥΠΟΘΕΣΕΩΣ: 'ΥΠΟΘΕΣ',
  ΥΠΟΘΕΣΕΩΝ: 'ΥΠΟΘΕΣ',
  ΘΕΩΝ: 'ΘΕ',
  ΓΥΝΑΙΚΕΙΟ: 'ΓΥΝΑΙΚ',
  ΤΕΛΕΙΟΥ: 'ΤΕΛΕΙ',
  ΤΕΛΕΙΩΝ: 'ΤΕΛΕΙ',
  ΘΕΙΑ: 'ΘΕΙ',
  ΠΑΙΔΙΑ: 'ΠΑΙΔ',
  ΖΗΛΙΑΡΙΚΟ: 'ζηλιαρικ', // ΖΗΛΙΑΡΙΚΟ: 'ΖΗΛΙΑΡ',
  ΑΓΡΟΙΚΟΥ: 'ΑΓΡΟΙΚ',
  ΑΓΑΠΑΜΕ: 'ΑΓΑΠ', //
  ΑΓΑΠΗΣΑΜΕ: 'ΑΓΑΠ',
  ΑΝΑΠΑΜΕ: 'ΑΝΑΠΑΜ',
  ΑΓΑΠΗΣΑΝΕ: 'ΑΓΑΠ',
  ΤΡΑΓΑΝΕ: 'ΤΡΑΓΑΝ',
  ΒΡΑΧΜΑΝΕ: 'ΒΡΑΧΜΑΝ',
  ΣΑΡΑΚΑΤΣΑΝΕ: 'ΣΑΡΑΚΑΤΣΑΝ',
  ΑΓΑΠΗΣΕΤΕ: 'αγαπησ', // ΑΓΑΠΗΣΕΤΕ: 'ΑΓΑΠ'
  ΒΕΝΕΤΕ: 'ΒΕΝΕΤ',
  ΑΓΑΠΩΝΤΑΣ: 'ΑΓΑΠ',
  ΑΡΧΟΝΤΑΣ: 'ΑΡΧΟΝΤ',
  ΚΡΕΩΝΤΑΣ: 'ΚΡΕΩΝΤ',
  ΑΓΑΠΙΟΜΑΣΤΕ: 'ΑΓΑΠ',
  ΟΝΟΜΑΣΤΕ: 'ΟΝΟΜΑΣΤ',
  ΑΓΑΠΙΕΣΤΕ: 'ΑΓΑΠ',
  ΠΙΕΣΤΕ: 'ΠΙΕΣΤ',
  ΕΚΤΕΛΕΣΤΕ: 'ΕΚΤΕΛΕΣΤ',
  ΧΤΙΣΤΗΚΕ: 'ΧΤΙΣΤ',
  ΔΙΑΘΗΚΗ: 'ΔΙΑΘΗΚ',
  ΔΙΑΘΗΚΕΣ: 'ΔΙΑΘΗΚ',
  ΚΑΤΑΚΤΗΘΗΚΕ: 'ΚΑΤΑΚΤ',
  ΠΟΛΕΜΗΘΗΚΕ: 'ΠΟΛΕΜ',
  ΧΤΥΠΩ: 'ΧΤΥΠ',
  ΧΤΥΠΟΥΣΕΣ: 'ΧΤΥΠ',
  ΜΕΔΟΥΣΑ: 'ΜΕΔΟΥΣ',
  ΜΕΔΟΥΣΕΣ: 'ΜΕΔΟΥΣ',
  ΚΟΛΛΑΩ: 'ΚΟΛΛ',
  ΚΟΛΛΑΓΕΣ: 'κολλαγ', // ΚΟΛΛΑΓΕΣ: 'ΚΟΛΛ',
  ΑΒΑΣΤΑΓΟ: 'ΑΒΑΣΤΑΓ',
  ΑΒΑΣΤΑΓΑ: 'ΑΒΑΣΤΑΓ',
  ΑΓΑΠΩ: 'ΑΓΑΠ',
  ΑΓΑΠΗΣΕ: 'ΑΓΑΠ',
  ΝΗΣΟΣ: 'ΝΗΣ',
  ΝΗΣΟΥ: 'ΝΗΣ',
  ΑΓΑΠΗΣΤΕ: 'ΑΓΑΠ',
  ΣΒΗΣΤΟΣ: 'ΣΒΗΣΤ',
  ΣΒΗΣΤΕ: 'ΣΒΗΣΤ',
  ΑΓΑΠΟΥΝΕ: 'ΑΓΑΠ',
  ΝΟΥΝΟΣ: 'ΝΟΥΝ',
  ΝΟΥΝΕ: 'ΝΟΥΝ',
  ΑΓΑΠΟΥΜΕ: 'ΑΓΑΠ',
  ΦΟΥΜΟΣ: 'ΦΟΥΜ',
  ΦΟΥΜΕ: 'ΦΟΥΜ',
  ΚΥΜΑ: 'ΚΥΜ',
  ΚΥΜΑΤΑ: 'ΚΥΜ',
  ΧΩΡΑΤΟ: 'ΧΩΡΑΤ',
  ΧΩΡΑΤΑ: 'ΧΩΡΑΤ',
  ΓΕΝΟΥΑ: 'ΓΕΝΟΥ',
  ΓΟΥΑ: 'ΓΟΥ',
  ΤΟΥΡΝΟΥΑ: 'ΤΟΥΡΝΟΥ',
  ΝΙΚΑΡΑΓΟΥΑ: 'ΝΙΚΑΡΑΓΟΥ',
  ΔΙΧΤΥ: 'ΔΙΧΤ',
  ΔΙΧΤΥΑ: 'ΔΙΧΤ',
  ΜΑΚΡΥ: 'ΜΑΚΡ',
  ΜΑΚΡΥΑ: 'ΜΑΚΡ',
  ΔΑΚΡΥ: 'ΔΑΚΡ',
  ΔΑΚΡΥΑ: 'ΔΑΚΡ',
  ΠΛΗΣΙΕΣΤΑΤΟΣ: 'ΠΛΗΣΙ',
  ΜΕΓΑΛΥΤΕΡΗ: 'ΜΕΓΑΛ',
  ΚΟΝΤΟΤΕΡΟ: 'ΚΟΝΤ',
};

describe('Greek Stemmer', () => {
  describe('Constructor', () => {
    test('It should create a new instance', () => {
      const stemmer = NlpUtil.getStemmer('el');
      expect(stemmer).toBeDefined();
    });
  });
  describe('Stem', () => {
    test('Should execute step1', () => {
      const stemmer = NlpUtil.getStemmer('el');
      const keys = Object.keys(feats);
      for (let i = 0; i < keys.length; i += 1) {
        const expected = [feats[keys[i]].toLowerCase().replace('ς', 'σ')];
        const actual = stemmer.tokenizeAndStem(keys[i]);
        expect(actual).toEqual(expected);
      }
    });
  });
});
