function registerTrigrams(container) {
  const language = container.get('Language');
  if (language) {
    language.addModel(
      'Cyrillic',
      'ukr',
      'на  пр і прарав наня ння заого поти го люд люво  ко мальнюдиих о н неавоанндин свсвоожнкоженнповжна доатиинаає а л буаціне уваобо ос якмає винихальабоє п тані ть овибо  ві абереі па мвинбезприільного пми та ом ою бодставоб бедо ва ті  обо вост в  щоий ся і с спиннвідстви пванновнанкон у ватонаії но дноій езппер деутиьноистпідстібут мои ііднаконніід тисщо роді ва зава пему і на псобої а вспрів нийякоду вноі дну арои с інля ріву в ріи днарненоваомуленнацнимисячи ав і рном роносві вниовн їїовіможвілу п пі суїї одн всовоютьістстьі з стбуд раченпророзівнодуа оьнини о сснознарацим о димия іціїх пдерчин соа сержи зи ве пди забосоу се бсі терніхя ні бкласпів і ніо зржастуїх а нннатакя пзпе одабедляту і мпеч длже ки вітнісгалагае мамизахримї отанкогресудь рето ковторарасвітваа божесоцоціціаоснробдь‐ь‐я‐які ізагахихиспілційх вливосвіалручь піншв яги аги дікоминиа іодиналтвокоївсія вноюоб о уо оі о'
    );
  }
}

export default registerTrigrams;
